dvescovi1/STM32DCC_CS/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdbool.h>
#include <stdint.h>

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
extern TIM_HandleTypeDef htim2;
extern TIM_HandleTypeDef htim15;
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void bsp_write_green_led(bool on);
void bsp_write_yellow_led(bool on);
void bsp_write_red_led(bool on);
 
void CS_HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim);

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TRACK_N_Pin GPIO_PIN_4
#define TRACK_N_GPIO_Port GPIOE
#define TRACK_P_Pin GPIO_PIN_5
#define TRACK_P_GPIO_Port GPIOE
#define LD2_Pin GPIO_PIN_4
#define LD2_GPIO_Port GPIOF
#define TRACK_Pin GPIO_PIN_0
#define TRACK_GPIO_Port GPIOA
#define LD1_Pin GPIO_PIN_0
#define LD1_GPIO_Port GPIOB
#define LD3_Pin GPIO_PIN_4
#define LD3_GPIO_Port GPIOG

/* USER CODE BEGIN Private defines */
// Track pins
#define TRACK_N_BS_Pos GPIO_BSRR_BS0_Pos
#define TRACK_N_BR_Pos GPIO_BSRR_BR0_Pos
#define TRACK_P_BS_Pos GPIO_BSRR_BS3_Pos
#define TRACK_P_BR_Pos GPIO_BSRR_BR3_Pos


/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
